//
//  main.c
//  HW_4_Lemeshaev_Stanislav
//
//  Created by Станислав Лемешаев on 11/02/2019.
//  Copyright © 2019 Станислав Лемешаев. All rights reserved.
//
//1. *Количество маршрутов с препятствиями. Реализовать чтение массива с препятствием и      нахождение количество маршрутов.
//Например, карта:
//3 3
//1 1 1
//0 1 0
//0 1 0
//
//2. Решить задачу о нахождении длины максимальной последовательности с помощью матрицы.
//3. ***Требуется обойти конем шахматную доску размером NxM, пройдя через все поля доски по одному разу. Здесь алгоритм решения такой же, как в задаче о 8 ферзях. Разница только в проверке положения коня.
#include <stdio.h>

int main(int argc, const char * argv[]) {
    // insert code here...
    printf("Hello, World!\n");
    return 0;
}
