//
//  main.c
//  HW_7_Lemeshaev_Stanislav
//
//  Created by Станислав Лемешаев on 24/02/2019.
//  Copyright © 2019 Станислав Лемешаев. All rights reserved.
//
//  1. Написать функции, которые считывают матрицу смежности из файла и выводят ее на экран.
//  2. Написать рекурсивную функцию обхода графа в глубину.
//  3. Написать функцию обхода графа в ширину.

#include <stdio.h>

int main(int argc, const char * argv[]) {
    // insert code here...
    printf("Hello, World!\n");
    return 0;
}
